Revit 2024 API
AnalysisDisplayDeformedShapeSettings.TextTypeId Property
 Element id of text associated with the settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId TextTypeId { get; set; }
Visual Basic
Public Property TextTypeId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ TextTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
AnalysisDisplayDeformedShapeSettings Class
Autodesk.Revit.DB.Analysis Namespace